MGNDTI(
  (drug_extractor): MolecularGCN(
    (init_transform): Linear(in_features=75, out_features=128, bias=False)
    (gnn): GCN(
      (gnn_layers): ModuleList(
        (0-2): 3 x GCNLayer(
          (graph_conv): GraphConv(in=128, out=128, normalization=none, activation=<function relu at 0x7f9f934b98b0>)
          (dropout): Dropout(p=0.0, inplace=False)
          (res_connection): Linear(in_features=128, out_features=128, bias=True)
          (bn_layer): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
  )
  (smiles_extractor): MolecularRetNet(
    (embedding): Embedding(65, 128, padding_idx=0)
    (retnet): RetNet(
      (retentions): ModuleList(
        (0): MultiScaleRetention(
          (group_norm): GroupNorm(8, 128, eps=1e-05, affine=True)
          (retentions): ModuleList(
            (0-7): 8 x SimpleRetention(
              (xpos): XPOS()
            )
          )
        )
      )
      (ffns): ModuleList(
        (0): Sequential(
          (0): Linear(in_features=128, out_features=64, bias=True)
          (1): GELU(approximate='none')
          (2): Linear(in_features=64, out_features=128, bias=True)
        )
      )
      (layer_norms_1): ModuleList(
        (0): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
      )
      (layer_norms_2): ModuleList(
        (0): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
      )
    )
  )
  (protein_extractor): ProteinRetNet(
    (embedding): Embedding(26, 128, padding_idx=0)
    (retnet): RetNet(
      (retentions): ModuleList(
        (0): MultiScaleRetention(
          (group_norm): GroupNorm(8, 128, eps=1e-05, affine=True)
          (retentions): ModuleList(
            (0-7): 8 x SimpleRetention(
              (xpos): XPOS()
            )
          )
        )
      )
      (ffns): ModuleList(
        (0): Sequential(
          (0): Linear(in_features=128, out_features=64, bias=True)
          (1): GELU(approximate='none')
          (2): Linear(in_features=64, out_features=128, bias=True)
        )
      )
      (layer_norms_1): ModuleList(
        (0): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
      )
      (layer_norms_2): ModuleList(
        (0): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
      )
    )
  )
  (multi_gating_network): MultimodalGatingNetwork(
    (gated_g): GLU(
      (W): Linear(in_features=128, out_features=128, bias=True)
      (V): Linear(in_features=128, out_features=128, bias=True)
      (sigmoid): Sigmoid()
    )
    (gated_s): GLU(
      (W): Linear(in_features=128, out_features=128, bias=True)
      (V): Linear(in_features=128, out_features=128, bias=True)
      (sigmoid): Sigmoid()
    )
    (gated_p): GLU(
      (W): Linear(in_features=128, out_features=128, bias=True)
      (V): Linear(in_features=128, out_features=128, bias=True)
      (sigmoid): Sigmoid()
    )
    (tanh): Tanh()
  )
  (mlp_classifier): MLPDecoder(
    (fc1): Linear(in_features=256, out_features=512, bias=True)
    (bn1): BatchNorm1d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (fc2): Linear(in_features=512, out_features=512, bias=True)
    (bn2): BatchNorm1d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (fc3): Linear(in_features=512, out_features=128, bias=True)
    (bn3): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (fc4): Linear(in_features=128, out_features=1, bias=True)
  )
)